## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_key_vault.current_key will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "current_key" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "vj-rcm-dev-kv"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "vj-rcm-dev-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # data.azurerm_key_vault_secret.current_adls_secret will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "current_adls_secret" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "vj-adls-access-key-dev"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # azurerm_data_factory.rcm_adf will be created
  + resource "azurerm_data_factory" "rcm_adf" {
      + id                     = (known after apply)
      + location               = "swedencentral"
      + name                   = "vj-rcm-dev-adf"
      + public_network_enabled = true
      + resource_group_name    = "vj-rcm-dev-rg"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azurerm_data_factory_linked_service_data_lake_storage_gen2.rcm_adls_ls will be created
  + resource "azurerm_data_factory_linked_service_data_lake_storage_gen2" "rcm_adls_ls" {
      + data_factory_id      = (known after apply)
      + id                   = (known after apply)
      + name                 = "vj-rcm-dev-adls-ls"
      + storage_account_key  = (sensitive value)
      + url                  = "https://vjrcmdevstorage.dfs.core.windows.net/"
      + use_managed_identity = false
    }

  # azurerm_data_factory_linked_service_key_vault.rcm_kv_ls will be created
  + resource "azurerm_data_factory_linked_service_key_vault" "rcm_kv_ls" {
      + data_factory_id = (known after apply)
      + id              = (known after apply)
      + key_vault_id    = (known after apply)
      + name            = "vj-rcm-dev-kv-ls"
    }

  # azurerm_data_factory_linked_service_sql_server.rcm_sqldb_ls will be created
  + resource "azurerm_data_factory_linked_service_sql_server" "rcm_sqldb_ls" {
      + connection_string = "Integrated Security=False;Data Source = vjrcmdevsql.database.windows.net ;Initial Catalog=@{linkedService().db_name};User ID=azuresqladmin"
      + data_factory_id   = (known after apply)
      + id                = (known after apply)
      + name              = "vj-rcm-dev-sqldb-ls"
      + parameters        = {
          + "db_name" = "string"
        }
      + user_name         = "azuresqladmin"

      + key_vault_password {
          + linked_service_name = "vj-rcm-dev-kv-ls"
          + secret_name         = "vj-sqldb-access-key-dev"
        }
    }

  # azurerm_databricks_workspace.rcm_adb will be created
  + resource "azurerm_databricks_workspace" "rcm_adb" {
      + customer_managed_key_enabled      = false
      + disk_encryption_set_id            = (known after apply)
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + location                          = "swedencentral"
      + managed_disk_identity             = (known after apply)
      + managed_resource_group_id         = (known after apply)
      + managed_resource_group_name       = (known after apply)
      + name                              = "vj-rcm-dev-adb"
      + public_network_access_enabled     = true
      + resource_group_name               = "vj-rcm-dev-rg"
      + sku                               = "standard"
      + storage_account_identity          = (known after apply)
      + tags                              = {
          + "Environment" = "Staging"
        }
      + workspace_id                      = (known after apply)
      + workspace_url                     = (known after apply)

      + custom_parameters (known after apply)
    }

  # azurerm_key_vault.rcm_kv will be created
  + resource "azurerm_key_vault" "rcm_kv" {
      + access_policy                 = [
          + {
              + key_permissions     = [
                  + "Get",
                  + "List",
                  + "Update",
                  + "Create",
                  + "Import",
                  + "Delete",
                  + "Recover",
                  + "Backup",
                  + "Restore",
                  + "Decrypt",
                  + "Encrypt",
                  + "UnwrapKey",
                  + "WrapKey",
                  + "Verify",
                  + "Sign",
                  + "Purge",
                  + "Release",
                  + "Rotate",
                  + "GetRotationPolicy",
                  + "SetRotationPolicy",
                ]
              + object_id           = "68469a57-c1fd-46d1-ba9c-c42616f8ea86"
              + secret_permissions  = [
                  + "Get",
                  + "List",
                  + "Set",
                  + "Delete",
                  + "Recover",
                  + "Backup",
                  + "Restore",
                  + "Purge",
                ]
              + storage_permissions = [
                  + "Backup",
                  + "Delete",
                  + "DeleteSAS",
                  + "Get",
                  + "GetSAS",
                  + "List",
                  + "ListSAS",
                  + "Purge",
                  + "Recover",
                  + "RegenerateKey",
                  + "Restore",
                  + "Set",
                  + "SetSAS",
                  + "Update",
                ]
              + tenant_id           = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
            },
        ]
      + enabled_for_disk_encryption   = true
      + id                            = (known after apply)
      + location                      = "swedencentral"
      + name                          = "vj-rcm-dev-kv"
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + resource_group_name           = "vj-rcm-dev-rg"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tenant_id                     = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
      + vault_uri                     = (known after apply)

      + contact (known after apply)

      + network_acls (known after apply)
    }

  # azurerm_key_vault_access_policy.rcm-adf-mi will be created
  + resource "azurerm_key_vault_access_policy" "rcm-adf-mi" {
      + id                 = (known after apply)
      + key_permissions    = [
          + "Get",
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Recover",
          + "Backup",
          + "Restore",
          + "Decrypt",
          + "Encrypt",
          + "UnwrapKey",
          + "WrapKey",
          + "Verify",
          + "Sign",
          + "Purge",
        ]
      + key_vault_id       = (known after apply)
      + object_id          = (known after apply)
      + secret_permissions = [
          + "Get",
          + "List",
          + "Set",
          + "Delete",
          + "Recover",
          + "Backup",
          + "Restore",
          + "Purge",
        ]
      + tenant_id          = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
    }

  # azurerm_key_vault_access_policy.rcm-adf-principal will be created
  + resource "azurerm_key_vault_access_policy" "rcm-adf-principal" {
      + id                 = (known after apply)
      + key_permissions    = [
          + "Get",
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Recover",
          + "Backup",
          + "Restore",
          + "Decrypt",
          + "Encrypt",
          + "UnwrapKey",
          + "WrapKey",
          + "Verify",
          + "Sign",
          + "Purge",
        ]
      + key_vault_id       = (known after apply)
      + object_id          = "a1ca21ef-2507-4022-b5f3-a5f9c2970bba"
      + secret_permissions = [
          + "Get",
          + "List",
          + "Set",
          + "Delete",
          + "Recover",
          + "Backup",
          + "Restore",
          + "Purge",
        ]
      + tenant_id          = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
    }

  # azurerm_key_vault_access_policy.rcm-adls-principal will be created
  + resource "azurerm_key_vault_access_policy" "rcm-adls-principal" {
      + id                 = (known after apply)
      + key_permissions    = [
          + "Get",
          + "List",
          + "UnwrapKey",
          + "WrapKey",
        ]
      + key_vault_id       = (known after apply)
      + object_id          = "c8df4345-5fc6-42a6-975f-ba96526d3f73"
      + secret_permissions = [
          + "Get",
          + "List",
        ]
      + tenant_id          = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
    }

  # azurerm_key_vault_secret.rcm_adls_kv will be created
  + resource "azurerm_key_vault_secret" "rcm_adls_kv" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "vj-adls-access-key-dev"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.rcm_sqldb_kv will be created
  + resource "azurerm_key_vault_secret" "rcm_sqldb_kv" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "vj-sqldb-access-key-dev"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_mssql_database.rcm_db["vj-rcm-hos-a"] will be created
  + resource "azurerm_mssql_database" "rcm_db" {
      + auto_pause_delay_in_minutes                                = (known after apply)
      + collation                                                  = (known after apply)
      + create_mode                                                = "Default"
      + creation_source_database_id                                = (known after apply)
      + enclave_type                                               = (known after apply)
      + geo_backup_enabled                                         = true
      + id                                                         = (known after apply)
      + ledger_enabled                                             = (known after apply)
      + license_type                                               = (known after apply)
      + maintenance_configuration_name                             = (known after apply)
      + max_size_gb                                                = (known after apply)
      + min_capacity                                               = (known after apply)
      + name                                                       = "vj-rcm-hos-a"
      + read_replica_count                                         = (known after apply)
      + read_scale                                                 = (known after apply)
      + restore_point_in_time                                      = (known after apply)
      + sample_name                                                = (known after apply)
      + secondary_type                                             = (known after apply)
      + server_id                                                  = (known after apply)
      + sku_name                                                   = (known after apply)
      + storage_account_type                                       = "Geo"
      + transparent_data_encryption_enabled                        = true
      + transparent_data_encryption_key_automatic_rotation_enabled = false
      + zone_redundant                                             = (known after apply)

      + long_term_retention_policy (known after apply)

      + short_term_retention_policy (known after apply)

      + threat_detection_policy (known after apply)
    }

  # azurerm_mssql_database.rcm_db["vj-rcm-hos-b"] will be created
  + resource "azurerm_mssql_database" "rcm_db" {
      + auto_pause_delay_in_minutes                                = (known after apply)
      + collation                                                  = (known after apply)
      + create_mode                                                = "Default"
      + creation_source_database_id                                = (known after apply)
      + enclave_type                                               = (known after apply)
      + geo_backup_enabled                                         = true
      + id                                                         = (known after apply)
      + ledger_enabled                                             = (known after apply)
      + license_type                                               = (known after apply)
      + maintenance_configuration_name                             = (known after apply)
      + max_size_gb                                                = (known after apply)
      + min_capacity                                               = (known after apply)
      + name                                                       = "vj-rcm-hos-b"
      + read_replica_count                                         = (known after apply)
      + read_scale                                                 = (known after apply)
      + restore_point_in_time                                      = (known after apply)
      + sample_name                                                = (known after apply)
      + secondary_type                                             = (known after apply)
      + server_id                                                  = (known after apply)
      + sku_name                                                   = (known after apply)
      + storage_account_type                                       = "Geo"
      + transparent_data_encryption_enabled                        = true
      + transparent_data_encryption_key_automatic_rotation_enabled = false
      + zone_redundant                                             = (known after apply)

      + long_term_retention_policy (known after apply)

      + short_term_retention_policy (known after apply)

      + threat_detection_policy (known after apply)
    }

  # azurerm_mssql_firewall_rule.rcm_fw will be created
  + resource "azurerm_mssql_firewall_rule" "rcm_fw" {
      + end_ip_address   = "0.0.0.0"
      + id               = (known after apply)
      + name             = "FirewallRule1"
      + server_id        = (known after apply)
      + start_ip_address = "0.0.0.0"
    }

  # azurerm_mssql_server.rcm_server will be created
  + resource "azurerm_mssql_server" "rcm_server" {
      + administrator_login                  = "azuresqladmin"
      + administrator_login_password         = (sensitive value)
      + connection_policy                    = "Default"
      + fully_qualified_domain_name          = (known after apply)
      + id                                   = (known after apply)
      + location                             = "swedencentral"
      + minimum_tls_version                  = "1.2"
      + name                                 = "vjrcmdevsql"
      + outbound_network_restriction_enabled = false
      + primary_user_assigned_identity_id    = (known after apply)
      + public_network_access_enabled        = true
      + resource_group_name                  = "vj-rcm-dev-rg"
      + restorable_dropped_database_ids      = (known after apply)
      + version                              = "12.0"
    }

Plan: 15 to add, 0 to change, 0 to destroy.
```
</details>